CREATE TABLE `student` (
  `id` int unsigned NOT NULL AUTO_INCREMENT COMMENT 'ID,主键',
  `name` varchar(10) COLLATE utf8mb3_bin NOT NULL COMMENT '姓名',
  `no` char(10) COLLATE utf8mb3_bin NOT NULL COMMENT '学号',
  `gender` tinyint unsigned NOT NULL COMMENT '性别, 1: 男, 2: 女',
  `phone` varchar(11) COLLATE utf8mb3_bin NOT NULL COMMENT '手机号',
  `id_card` char(18) COLLATE utf8mb3_bin NOT NULL COMMENT '身份证号',
  `is_college` tinyint unsigned NOT NULL COMMENT '是否来自于院校, 1:是, 0:否',
  `address` varchar(100) COLLATE utf8mb3_bin DEFAULT NULL COMMENT '联系地址',
  `degree` tinyint unsigned DEFAULT NULL COMMENT '最高学历, 1:初中, 2:高中, 3:大专, 4:本科, 5:硕士, 6:博士',
  `graduation_date` date DEFAULT NULL COMMENT '毕业时间',
  `clazz_id` int unsigned NOT NULL COMMENT '班级ID, 关联班级表ID',
  `violation_count` tinyint unsigned NOT NULL DEFAULT '0' COMMENT '违纪次数',
  `violation_score` tinyint unsigned NOT NULL DEFAULT '0' COMMENT '违纪扣分',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `update_time` datetime DEFAULT NULL COMMENT '修改时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `no` (`no`),
  UNIQUE KEY `phone` (`phone`),
  UNIQUE KEY `id_card` (`id_card`)
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_bin COMMENT='学员表';

-- ----------------------------
-- Records of student
-- ----------------------------
INSERT INTO `student` VALUES ('1', '段誉', '2022000001', '1', '18800000001', '110120000300200001', '1', '北京市昌平区建材城西路1号', '1', '2021-07-01', '2', '0', '0', '2024-11-14 21:22:19', '2024-11-15 16:20:59');
INSERT INTO `student` VALUES ('2', '萧峰', '2022000002', '1', '18800210003', '110120000300200002', '1', '北京市昌平区建材城西路2号', '2', '2022-07-01', '1', '0', '0', '2024-11-14 21:22:19', '2024-11-14 21:22:19');
INSERT INTO `student` VALUES ('3', '虚竹', '2022000003', '1', '18800013001', '110120000300200003', '1', '北京市昌平区建材城西路3号', '2', '2024-07-01', '1', '0', '0', '2024-11-14 21:22:19', '2024-11-14 21:22:19');
INSERT INTO `student` VALUES ('4', '萧远山', '2022000004', '1', '18800003211', '110120000300200004', '1', '北京市昌平区建材城西路4号', '3', '2024-07-01', '1', '0', '0', '2024-11-14 21:22:19', '2024-11-14 21:22:19');
INSERT INTO `student` VALUES ('5', '阿朱', '2022000005', '2', '18800160002', '110120000300200005', '1', '北京市昌平区建材城西路5号', '4', '2020-07-01', '1', '0', '0', '2024-11-14 21:22:19', '2024-11-14 21:22:19');
INSERT INTO `student` VALUES ('6', '阿紫', '2022000006', '2', '18800000034', '110120000300200006', '1', '北京市昌平区建材城西路6号', '4', '2021-07-01', '2', '0', '0', '2024-11-14 21:22:19', '2024-11-14 21:22:19');
INSERT INTO `student` VALUES ('7', '游坦之', '2022000007', '1', '18800000067', '110120000300200007', '1', '北京市昌平区建材城西路7号', '4', '2022-07-01', '2', '0', '0', '2024-11-14 21:22:19', '2024-11-14 21:22:19');
INSERT INTO `student` VALUES ('8', '康敏', '2022000008', '2', '18800000077', '110120000300200008', '1', '北京市昌平区建材城西路8号', '5', '2024-07-01', '2', '0', '0', '2024-11-14 21:22:19', '2024-11-14 21:22:19');
INSERT INTO `student` VALUES ('9', '徐长老', '2022000009', '1', '18800000341', '110120000300200009', '1', '北京市昌平区建材城西路9号', '3', '2024-07-01', '2', '0', '0', '2024-11-14 21:22:19', '2024-11-14 21:22:19');
INSERT INTO `student` VALUES ('10', '云中鹤', '2022000010', '1', '18800006571', '110120000300200010', '1', '北京市昌平区建材城西路10号', '2', '2020-07-01', '2', '0', '0', '2024-11-14 21:22:19', '2024-11-14 21:22:19');
INSERT INTO `student` VALUES ('11', '钟万仇', '2022000011', '1', '18800000391', '110120000300200011', '1', '北京市昌平区建材城西路11号', '4', '2021-07-01', '1', '0', '0', '2024-11-14 21:22:19', '2024-11-15 16:21:24');
INSERT INTO `student` VALUES ('12', '崔百泉', '2022000012', '1', '18800000781', '110120000300200018', '1', '北京市昌平区建材城西路12号', '4', '2022-07-05', '8', '7', '20', '2024-11-14 21:22:19', '2024-12-13 14:33:58');
INSERT INTO `student` VALUES ('13', '耶律洪基', '2022000013', '1', '18800008901', '110120000300200013', '1', '北京市昌平区建材城西路13号', '4', '2024-07-01', '2', '0', '0', '2024-11-14 21:22:19', '2024-11-15 16:21:21');
INSERT INTO `student` VALUES ('14', '天山童姥', '2022000014', '2', '18800009201', '110120000300200014', '1', '北京市昌平区建材城西路14号', '4', '2024-07-01', '1', '0', '0', '2024-11-14 21:22:19', '2024-11-15 16:21:17');
INSERT INTO `student` VALUES ('17', '王语嫣', '2022000017', '2', '18800007601', '110120000300200017', '1', '北京市昌平区建材城西路17号', '2', '2022-07-01', '9', '0', '0', '2024-11-14 21:22:19', '2025-05-10 14:58:56');
INSERT INTO `student` VALUES ('18', '郑成功', '2024001101', '1', '13309092345', '110110110110110110', '0', '北京市昌平区回龙观街道88号', '5', '2021-07-01', '8', '4', '11', '2024-11-15 16:26:18', '2024-11-15 16:40:10');
INSERT INTO `student` VALUES ('19', '冯奥鹏', '5120200575', '1', '17633895579', '412827200204135715', '1', '黑马程序员', '4', '2025-05-09', '3', '1', '5', '2025-05-10 14:11:00', '2025-05-10 14:42:52');
